Mecapitronic/Esp32_Hardware/include/ServoAX12.h
#ifndef SERVO_AX12_H
#define SERVO_AX12_H

#include <Dynamixel2Arduino.h>
#include <unordered_map>

#include "ESP32_Hardware.h"

namespace ServoAX12
{
    // https://github.com/ROBOTIS-GIT/Dynamixel2Arduino/tree/master

    constexpr size_t MAX_BAUD = 5;
    const BaudRate dxlBaud[MAX_BAUD] = {BaudRate::BAUD_RATE_57600,
                                        BaudRate::BAUD_RATE_115200,
                                        BaudRate::BAUD_RATE_1000000,
                                        BaudRate::BAUD_RATE_2000000,
                                        BaudRate::BAUD_RATE_3000000};

    enum class DxlProtocolVersion
    {
        PROTOCOL_1 = 1,
        PROTOCOL_2 = 2
    };

    constexpr size_t MAX_PROTOCOL = 2;
    const DxlProtocolVersion dxlProtocol[MAX_PROTOCOL] = {DxlProtocolVersion::PROTOCOL_1,
                                                          DxlProtocolVersion::PROTOCOL_2};

    // id vitesse acceleration position command_position ledState
    /**
     * @brief Structure représentant l'état d'un servo moteur.
     * @param id Identifiant du servo moteur.
     * @param vitesse Vitesse maximale du servo moteur en degrés par seconde.
     * @param positionMin Position minimale du servo moteur.
     * @param positionMax Position maximale du servo moteur.
     * @param command_position Position cible du servo moteur.
     * @param ledState État de la LED du servo moteur (allumée en mouvement, éteinte
     * sinon).
     */
    struct ServoMotion
    {
        uint8_t id = (uint8_t)Hardware_Config::ServoID::BroadCast;
        String name = "";
        float position = 0;
        Hardware_Config::ServoPosition positionMin = Hardware_Config::ServoPosition::Min;
        Hardware_Config::ServoPosition positionMax = Hardware_Config::ServoPosition::Max;
        float command_position = 0;
        bool IsMoving = false;
        bool ledState = false;
        Timeout timeOut;
        // Tracking d'état d'initialisation
        bool initialized = false;           // Servo connecté et prêt
        uint32_t lastInitAttempt = 0;   // Timestamp du dernier tentative d'init (ms)
        int failureCount = 0;           // Compteur d'erreurs consécutives
        
        ServoMotion() = default;

        /**
         * @brief Construct a new Servo Motion object
         *
         * @param _id Identifiant du servo moteur
         * @param _vitesse Vitesse maximale du servo moteur en degrés par seconde
         * @param _acceleration Accélération maximale du servo moteur en degrés par
         * seconde carrée
         */
        ServoMotion(Hardware_Config::ServoID _id,
                    String _name,
                    Hardware_Config::ServoPosition _positionMin,
                    Hardware_Config::ServoPosition _positionMax)
        {
            // Initialisation des valeurs
            id = (uint8_t)_id;
            name = _name;
            positionMin = _positionMin;
            positionMax = _positionMax;
        }

        bool operator==(const ServoMotion &other) const
        {
            return id == other.id;
        }
    };

    void Initialisation(HardwareSerial &serial, int8_t rxPin, int8_t txPin, int8_t dirPin, BaudRate baudRate = BaudRate::BAUD_RATE_1000000, DxlProtocolVersion dxlProtocolVersion = DxlProtocolVersion::PROTOCOL_1);
    
    [[noreturn]] void TaskUpdateServo(void *pvParameters);

    void InitServo(ServoMotion &servo);
    
    void AddServo(Hardware_Config::ServoID id, String name, Hardware_Config::ServoPosition positionMin, Hardware_Config::ServoPosition positionMax);

    ServoMotion GetServoByName(const String &name);
    ServoMotion GetServoByNumber(uint8_t number);
    ServoMotion GetServoByID(Hardware_Config::ServoID id);

    void StopAllServo();
    void StopServo(ServoMotion &servo);

    void StartAllServo();
    void StartServo(ServoMotion &servo);
    
    void UpdateServo(ServoMotion &servo);

    bool AreAllServoMoving();
    bool IsServoMoving(Hardware_Config::ServoID id);

    void SetServoPosition(Hardware_Config::ServoID id, Hardware_Config::ServoPosition position, int timeOutMs = 0);
    void SetServoPosition(Hardware_Config::ServoID id, float position, int timeOutMs = 0);

    float GetServoPosition(Hardware_Config::ServoID id);
    
    bool HandleCommand(Command cmd);
    void PrintCommandHelp();

    int16_t Scan();
    int16_t Scan(DxlProtocolVersion _protocol, BaudRate _dxlBaud);
    void PrintDxlInfo(Hardware_Config::ServoID id = Hardware_Config::ServoID::BroadCast);

    void TeleplotAllPosition();
    void TeleplotPosition(Hardware_Config::ServoID id);
    void PrintAllPosition();
    void PrintPosition(Hardware_Config::ServoID id);
} // namespace ServoAX12

namespace std
{
    template <> struct hash<ServoAX12::ServoMotion>
    {
        std::size_t operator()(const ServoAX12::ServoMotion &k) const
        {
            // Hash only the name, since operator== only compares id
            return std::hash<uint8_t>()(k.id);
        }
    };
} // namespace std
#endif